# Pandas: Data Analysis Made Easy

[Pandas](https://pandas.pydata.org/) is an open-source data manipulation and analysis library for Python. It provides powerful tools for working with structured data, making data analysis tasks more efficient and intuitive.

## Why Pandas?

- **Flexible Data Structures:** Pandas offers two main data structures: Series (1-dimensional) and DataFrame (2-dimensional), which can handle both labeled and unlabelled data.

- **Data Cleaning and Preparation:** Pandas simplifies the process of cleaning and preparing data by providing functions to handle missing data, duplicate entries, data type conversions, and more.

- **Data Exploration and Analysis:** With Pandas, you can easily explore and analyze your data using functions for filtering, sorting, grouping, aggregating, and visualizing data.

- **Integration with Other Libraries:** Pandas seamlessly integrates with other Python libraries like NumPy, Matplotlib, and scikit-learn, making it a powerful tool for data analysis and machine learning workflows.

- **Rich Functionality:** Pandas offers a wide range of functions and methods for data manipulation, including merging and joining datasets, reshaping data, time series analysis, and handling large datasets efficiently.

- **Community Support:** Pandas has a large and active community of users and developers who contribute to its development, provide support, and share resources and best practices.

## Getting Started with Pandas

To get started with Pandas, you can install it using pip:

```bash
pip install pandas

In [1]:
! pip install pandas

Collecting pandas
  Using cached pandas-2.0.3-cp38-cp38-win_amd64.whl.metadata (18 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\harsh\miniconda3\envs\test\lib\site-packages (from pandas) (2.8.2)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2024.1-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.1 (from pandas)
  Using cached tzdata-2024.1-py2.py3-none-any.whl.metadata (1.4 kB)
Collecting numpy>=1.20.3 (from pandas)
  Using cached numpy-1.24.4-cp38-cp38-win_amd64.whl.metadata (5.6 kB)
Requirement already satisfied: six>=1.5 in c:\users\harsh\miniconda3\envs\test\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Using cached pandas-2.0.3-cp38-cp38-win_amd64.whl (10.8 MB)
Using cached numpy-1.24.4-cp38-cp38-win_amd64.whl (14.9 MB)
Using cached pytz-2024.1-py2.py3-none-any.whl (505 kB)
Using cached tzdata-2024.1-py2.py3-none-any.whl (345 kB)
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-1.24.4 pandas-2.0.3 pytz-2024.1 tzdata-2024.1

Once installed, you can import Pandas in your Python scripts or Jupyter notebooks and start working with your data.

```bash
import pandas as pd

In [2]:
import pandas as pd

## READ

### read from csv file

In [3]:
# Reading CSV files
reviews = pd.read_csv("data/shootings.csv", index_col=0)
# first 3 rows are printed
reviews.head(3)

,name,date,manner_of_death,armed,age,gender,race,city,state,signs_of_mental_illness,threat_level,flee,body_camera,arms_category
id,,,,,,,,,,,,,,
3,Tim Elliot,2015-01-02,shot,gun,53.0,M,Asian,Shelton,WA,True,attack,Not fleeing,False,Guns
4,Lewis Lee Lembke,2015-01-02,shot,gun,47.0,M,White,Aloha,OR,False,attack,Not fleeing,False,Guns
5,John Paul Quintero,2015-01-03,shot and Tasered,unarmed,23.0,M,Hispanic,Wichita,KS,False,other,Not fleeing,False,Unarmed

In [4]:
# last 5 rows
reviews.tail()

,name,date,manner_of_death,armed,age,gender,race,city,state,signs_of_mental_illness,threat_level,flee,body_camera,arms_category
id,,,,,,,,,,,,,,
5916,Rayshard Brooks,2020-06-12,shot,Taser,27.0,M,Black,Atlanta,GA,False,attack,Foot,True,Electrical devices
5925,Caine Van Pelt,2020-06-12,shot,gun,23.0,M,Black,Crown Point,IN,False,attack,Car,False,Guns
5918,Hannah Fizer,2020-06-13,shot,unarmed,25.0,F,White,Sedalia,MO,False,other,Not fleeing,False,Unarmed
5921,William Slyter,2020-06-13,shot,gun,22.0,M,White,Kansas City,MO,False,other,Other,False,Guns
5924,Nicholas Hirsh,2020-06-15,shot,gun,31.0,M,White,Lawrence,KS,False,attack,Car,False,Guns

In [5]:
# All columns of the dataframe
reviews.columns

Index(['name', 'date', 'manner_of_death', 'armed', 'age', 'gender', 'race',
       'city', 'state', 'signs_of_mental_illness', 'threat_level', 'flee',
       'body_camera', 'arms_category'],
      dtype='object')

In [6]:
# shows that the readed csv file is in dataframe format
type(reviews)

pandas.core.frame.DataFrame

In [7]:
#skip first and 10th row
skip_rows = pd.read_csv("data/shootings.csv",skiprows = [1,10])
skip_rows.head(3)

,id,name,date,manner_of_death,armed,age,gender,race,city,state,signs_of_mental_illness,threat_level,flee,body_camera,arms_category
0,4,Lewis Lee Lembke,2015-01-02,shot,gun,47.0,M,White,Aloha,OR,False,attack,Not fleeing,False,Guns
1,5,John Paul Quintero,2015-01-03,shot and Tasered,unarmed,23.0,M,Hispanic,Wichita,KS,False,other,Not fleeing,False,Unarmed
2,8,Matthew Hoffman,2015-01-04,shot,toy weapon,32.0,M,White,San Francisco,CA,True,attack,Not fleeing,False,Other unusual objects

In [8]:
# number of null valules in each column
null_count_per_column = reviews.isnull().sum()
null_count_per_column

name                       0
date                       0
manner_of_death            0
armed                      0
age                        0
gender                     0
race                       0
city                       0
state                      0
signs_of_mental_illness    0
threat_level               0
flee                       0
body_camera                0
arms_category              0
dtype: int64

**describe()**
 
function in Pandas is a powerful tool for generating descriptive statistics of numerical data in a DataFrame. When applied to a DataFrame, it provides a summary of various statistical measures for each numerical column, including count, mean, standard deviation, minimum, maximum, and percentiles. This function is particularly useful for getting a quick overview of the distribution and central tendency of numerical data, helping users to understand their dataset's characteristics at a glance.

In [9]:
# only numeric columns are considered
reviews.describe()

               age
count  4895.000000
mean     36.549750
std      12.694348
min       6.000000
25%      27.000000
50%      35.000000
75%      45.000000
max      91.000000

In [10]:
# show the data type of each column
reviews.dtypes

name                        object
date                        object
manner_of_death             object
armed                       object
age                        float64
gender                      object
race                        object
city                        object
state                       object
signs_of_mental_illness       bool
threat_level                object
flee                        object
body_camera                   bool
arms_category               object
dtype: object

**Series in DataFrame**

In Pandas, a Series is a one-dimensional array-like object that can hold any data type (e.g., integers, strings, floats). It's essentially a labeled array capable of holding data of any type.

**Usage**

A Series is commonly used to represent a single column or row of data in a DataFrame. It can be created from various data structures like lists, dictionaries, or NumPy arrays.

In [12]:
# Series
type(reviews['age'])

pandas.core.series.Series

In [13]:
# when two square brackets are given then its considered as data frame
type(reviews[['age']])

pandas.core.frame.DataFrame

In [14]:
# getting the columns with name
reviews[['age', 'gender']]

       age gender
id
3     53.0      M
4     47.0      M
5     23.0      M
8     32.0      M
9     39.0      M
...    ...    ...
5916  27.0      M
5925  23.0      M
5918  25.0      F
5921  22.0      M
5924  31.0      M

[4895 rows x 2 columns]

### reading from excel file

here we need to install a module called openpyxl

```bash
! pip install openpyxl
```

In [ ]:
! pip install openpyxl

In [ ]:
df_excel = pd.read_excel("data/Cola.xlsx", names = ['Column1', 'Column2', 'Column3', 'Column4', 'Column5', 'Column6', 'Column7', 'Column8', 'Column9', 'Column10', 'Column11'])
df_excel.head()

### Reading from HTML

the data retrived from html page is a list we need to convert the data to csv, for this we need to install a module called lxml

```bash
! pip install lxml
```

In [ ]:
! pip install lxml

In [ ]:
df_html = pd.read_html('https://www.basketball-reference.com/teams/TOR/2024.html')
df_html

In [ ]:
# read_html returns a list 
type(df_html)

In [ ]:
# 3rd element of the list is the dataframe
type(df_html[2])

In [ ]:
df = df_html[2]
df.head()

### Using Requests Library in Python

The `requests` library is a popular HTTP library for Python, used to make HTTP requests and handle responses easily.

**Installation**

You can install the `requests` library using pip:

```bash
pip install requests

In [ ]:
! pip install requests

In [ ]:
# JSON data using URL
import requests
res = requests.get('https://api.github.com/repos/pandas-dev/pandas/issues')
data = res.json()
len(data)

In [ ]:
for i in range(len(data)):
    print(data[i]['url'])

In [ ]:
data_df = pd.DataFrame(data)
data_df.head()

In [ ]:
data_df['user'][:3]

**Using `pd.DataFrame.from_records()` in Pandas**

The `pd.DataFrame.from_records()` method in Pandas is used to create a DataFrame from a structured array or a sequence of tuples. It's particularly useful when you have a list of dictionaries or a structured array and you want to convert it into a DataFrame.

**Usage**

Suppose you have a DataFrame `data_df` with a column named `'user'`, and you want to create a new DataFrame from the values in this column. You can use `pd.DataFrame.from_records()` as follows:

In [ ]:
user_df = pd.DataFrame.from_records(data_df['user'])
user_df.head(2)

## save

### save as CSV file

A CSV (comma-separated values) file is a plain text file format used to store tabular data

In [ ]:

reviews.to_csv("reviews.csv") # save the dataframe as it is to csv

reviews.to_csv("reviews_1.csv", index=False) # save the dataframe as it is to csv without index

reviews.to_csv("reviews_2.csv", index=False, header=False) # save the dataframe as it is to csv without index and header

reviews.to_csv("reviews_3.csv", index=False, header=False, columns=None) # save the dataframe as it is to csv without index, header and columns

reviews.to_csv("reviews_4.csv", index=False, header=False, columns=None, sep=",") # save the dataframe as it is to csv without index, header and columns and with a separator

reviews.to_csv("reviews_5.csv", index=False, header=False, columns=None, sep=",", encoding="utf-8") # save the dataframe as it is to csv without index, header and columns and with a separator and encoding

reviews.to_csv("reviews_6.csv",index=False,sep = "#", columns=['gender','age']) # save the dataframe as it is to csv without index, seperate with '#' and columns age and gender

### Saving Data to a Pickle File

In Pandas, you can save a DataFrame or Series to a Pickle file using the `to_pickle()` method. Pickle is a binary serialization format in Python that allows you to store data objects in a compact binary format.

**Usage**

To save a DataFrame or Series to a Pickle file, use the `to_pickle()` method:

In [ ]:
reviews.to_pickle("my_pickle")

### SAVE as excel file

Excel files are digital spreadsheets that organize data in rows and columns, offering a versatile tool for tasks like calculations, data analysis, and information management.

In [ ]:
df.to_excel('player_details.xlsx')

## Synthetic Data Generation for Pandas

Synthetic data generation is the process of creating artificial data that resembles real-world data but is generated algorithmically. This can be useful for various purposes, including testing machine learning models, data augmentation, and privacy-preserving data sharing.

**Usage**

Pandas provides several methods for generating synthetic data:

#### Random Data Generation

Pandas' `DataFrame` constructor can be used to create synthetic data with random values:

##### Explanation of `np.random.randn(10, 4), columns=['A', 'B', 'C', 'D']`

- `np.random.randn(10, 4)`: This code generates a 2-dimensional array of random numbers with a normal distribution (mean=0, variance=1) of shape (10, 4), meaning it will create 10 rows and 4 columns of random numbers.

- `columns=['A', 'B', 'C', 'D']`: This code specifies the column names for the DataFrame that will be created using the random numbers generated above. The DataFrame will have columns named 'A', 'B', 'C', and 'D'.

Together, this code generates a DataFrame with 10 rows and 4 columns, where the values in each column are random numbers drawn from a normal distribution.

In [30]:
import pandas as pd
import numpy as np

# Create a DataFrame with random values
df = pd.DataFrame(np.random.randn(10, 4), columns=['A', 'B', 'C', 'D'])
df.head()

          A         B         C         D
0  1.227277  0.961877  0.085999 -1.198882
1  1.348714  0.111797 -1.473929 -1.828267
2 -1.049592 -0.835201  0.387533 -0.646786
3  0.865748 -0.146778 -0.159788  0.458548
4  0.236913  0.932560 -0.560691 -0.717966

#### JSON Data

we can also convert string to json data then to dataframe

In [31]:
data = {
  "name": "John Doe",
  "age": 30,
  "city": "New York",
  "interests": ["hiking", "reading", "cooking"]
    }
type(data)

dict

In [32]:
data_df = pd.DataFrame(data)
data_df

       name  age      city interests
0  John Doe   30  New York    hiking
1  John Doe   30  New York   reading
2  John Doe   30  New York   cooking

In [33]:
data_df['interests']

0     hiking
1    reading
2    cooking
Name: interests, dtype: object

##  concepts

### setting data

In [51]:
# Create a sample DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emily'],
        'Age': [25, 30, 35, 40, 45],
        'Salary': [50000, 60000, 70000, 80000, 90000],
        'Department': ['HR', 'IT', 'Finance', 'IT', 'HR']}

data2 = {'Name': ['Alice', 'Bob', 'Charlie'],
         'Hire_Date': ['2020-01-15', '2019-05-20', '2021-02-10']}

df = pd.DataFrame(data)
df2 = pd.DataFrame(data2)

In [49]:
df.head(2)

    Name  Age  Salary Department
0  Alice   25   50000         HR
1    Bob   30   60000         IT

In [52]:
df2.head(2)

    Name   Hire_Date
0  Alice  2020-01-15
1    Bob  2019-05-20

### iloc

**Usage**

The `iloc` indexer allows for integer-based indexing to select rows and columns from a DataFrame.

**Syntax**

```python
dataframe.iloc[row_indexer, column_indexer]

In [53]:
# Using iloc to select specific rows and columns 1 to 3 rows and 0 to 1 column will be selected
df.iloc[1:4, 0:2]

      Name  Age
1      Bob   30
2  Charlie   35

In [55]:
# 1 and 3 row and 0 and 2 column
df.iloc[[1,3], [0,2]]

    Name  Salary
1    Bob   60000
3  David   80000

### loc

**usage**

`loc` is a label-based indexing method in pandas DataFrame used to access rows and columns by label(s) or a boolean array.

**Syntax**

```python
DataFrame.loc[row_indexer, column_indexer]

In [58]:
input = df['Age'] > 30
input

0    False
1    False
2     True
3     True
4     True
Name: Age, dtype: bool

In [59]:
# Using loc to select data based on labels, only the values with true are displayed
df.loc[input]

      Name  Age  Salary Department
2  Charlie   35   70000    Finance
3    David   40   80000         IT
4    Emily   45   90000         HR

In [61]:
# if index is not specified loc can also used with numeric index just like iloc
df.loc[2]

Name          Charlie
Age                35
Salary          70000
Department    Finance
Name: 2, dtype: object

In [62]:
df.iloc[2]

Name          Charlie
Age                35
Salary          70000
Department    Finance
Name: 2, dtype: object

### Differance between iloc and loc

In [ ]:
# converting string to json and json to datframe
import json

# Synthetic data in JSON format
json_data = '''
{
  "data": [
    {"name": "John", "age": 30, "city": "New York"},
    {"name": "Alice", "age": 25, "city": "Los Angeles"},
    {"name": "Bob", "age": 35, "city": "Chicago"},
    {"name": "Emily", "age": 28, "city": "San Francisco"}
  ]
}
'''

# Load JSON data into a Python dictionary
data_dict = json.loads(json_data)

# Create DataFrame from dictionary with specified index
df_specified = pd.DataFrame(data_dict['data']).set_index('name')

df_specified.head(2)

In [64]:
# df_specified.iloc['Bob'] # error

df_specified.iloc[2]

age          35
city    Chicago
Name: Bob, dtype: object

In [65]:
# df_specified.loc[2] # this will return error

df_specified.loc['Bob']

age          35
city    Chicago
Name: Bob, dtype: object

### Group by


df_grouped = df.groupby('column_name').agg({'column_to_aggregate': 'function'})

In [69]:
# Grouping data by Department and calculating mean salary
grouped = df.groupby('Department')['Salary'].mean()
grouped

Department
Finance    70000.0
HR         70000.0
IT         70000.0
Name: Salary, dtype: float64

In [71]:
type(grouped)

pandas.core.series.Series

In [70]:
grouped_2 = df.groupby('Department').agg({'Salary': 'mean'})
grouped_2

             Salary
Department
Finance     70000.0
HR          70000.0
IT          70000.0

In [73]:
type(grouped_2)

pandas.core.frame.DataFrame

### Merge

In [74]:
merged_df = pd.merge(df, df2, on='Name')
merged_df

      Name  Age  Salary Department   Hire_Date
0    Alice   25   50000         HR  2020-01-15
1      Bob   30   60000         IT  2019-05-20
2  Charlie   35   70000    Finance  2021-02-10

### drop

In [75]:
# Dropping a column and update df since inplace = True
df.drop('Department', axis=1, inplace=True)

In [76]:
df

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    David   40   80000
4    Emily   45   90000

In [77]:
# Dropping a row
df_droped = df.drop(1, axis=0, inplace=False)
df_droped

      Name  Age  Salary
0    Alice   25   50000
2  Charlie   35   70000
3    David   40   80000
4    Emily   45   90000

In [78]:
df # row one not removed since inplace = False

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    David   40   80000
4    Emily   45   90000

In [79]:
# Describing the DataFrame, inlcude = all mean all the numerica and catagorical columns are included
df.describe(include='all')

         Name        Age        Salary
count       5   5.000000      5.000000
unique      5        NaN           NaN
top     Alice        NaN           NaN
freq        1        NaN           NaN
mean      NaN  35.000000  70000.000000
std       NaN   7.905694  15811.388301
min       NaN  25.000000  50000.000000
25%       NaN  30.000000  60000.000000
50%       NaN  35.000000  70000.000000
75%       NaN  40.000000  80000.000000
max       NaN  45.000000  90000.000000

## logic